[
  {
    "page": 23,
    "line": 4,
    "context": "AP UNITED STATES GOVERNMENT & POLITICS 1-2 001395 - 001396 GRADES: 12 UC/CSU: “A”\nRecommended Prerequisites: U.S. History or AP United States History (APUSH)\nFor students interested in: College level in depth exploration of U.S. Government and its practices\nLength of Course: Year-Long, linked w/Civics & Economics\nU.S. Government & Politics (Advanced Placement) is designed to give students a critical perspective on government,\npolitics and economics in the United States. The class involves both the study of general concepts used to interpret\nAmerican governmental, political and economic systems and the analysis of specific case studies. It also requires",
    "matched_line": "Length of Course: Year-Long, linked w/Civics & Economics"
  },
  {
    "page": 23,
    "line": 15,
    "context": "AP UNITED STATES HISTORY 1-2 001382 - 001383 GRADES: 11 UC/CSU: “A”\nRecommended Prerequisites: World History 1-2 or AP European History (APEH)\nFor students interested in: College level in depth exploration of United States History\nLength of Course: Year-Long, linked w/Honors American Literature\nU.S. History (Advanced Placement) 1-2 is an advanced course taught at the college level. It is designed for students\nwho wish to take the Advanced Placement examination, administered by Educational Testing Service, in the spring.\nThose passing the AP exam at a high level usually can receive college credit and a waiver of the college U.S. History",
    "matched_line": "Length of Course: Year-Long, linked w/Honors American Literature"
  },
  {
    "page": 23,
    "line": 25,
    "context": "AP WORLD HISTORY 1-2 001307 - 001308 GRADES: 10 UC/CSU: “A”\nRecommended Prerequisites: None\nFor students interested in: College level in depth exploration of World History\nLength of Course: Year-Long, linked w/Honors World History 1-2\nThe purpose of the AP World History course is to develop greater understanding of the evolution of global processes\nand contacts, in interaction with different types of human societies. This understanding is advanced through a\ncombination of selective factual knowledge and appropriate analytical skills. The course highlights the nature of",
    "matched_line": "Length of Course: Year-Long, linked w/Honors World History 1-2"
  },
  {
    "page": 24,
    "line": 20,
    "context": "HONORS WORLD HISTORY 1-2 001305 - 001306 GRADES: 10 UC/CSU: “A”\nRecommended Prerequisites: None\nFor students interested in: College level in depth exploration of European Civilization\nLength of Course: Year-long , linked w/AP World History\nHonors World History 1-2 is designed to help more students to be successful in AP World History. The course will\nprepare students to read non-fiction thoroughly and critically, to take notes from content-rich lectures, and to write\nconcisely. Students will study the first third of the AP World History curriculum, adding, from the World History",
    "matched_line": "Length of Course: Year-long , linked w/AP World History"
  },
  {
    "page": 26,
    "line": 24,
    "context": "AP ENGLISH LITERATURE 1-2 000370 - 000371 GRADES: 12 UC/CSU: “B”\nRecommended Prerequisites: American Literature, Honors American Literature\nFor students interested in: College level in-depth exploration of Western literacy development\nLength of Course: Year-Long, linked w/British Literature 1-2\nAdvanced Placement English Literature 1-2 (combined with British Literature 1-2) is a year-long college-level course\ndesigned to prepare students to take the Advanced Placement English Literature examination and possibly to earn\ncollege credits. The course presents examples of literature from the Ancient Greeks through the 21st century,",
    "matched_line": "Length of Course: Year-Long, linked w/British Literature 1-2"
  },
  {
    "page": 27,
    "line": 3,
    "context": "BRITISH LITERATURE 1-2 000384 - 000385 GRADES: 12 UC/CSU: “B”\nRecommended Prerequisites: American Literature, Honors American Literature\nFor students interested in: Seek exposure to British Literature\nLength of Course: Year-Long, linked w/AP English Literature 1-2\nBritish Literature 1-2 is a course that acquaints students with various genres and themes of literature produced by\nIrish, English, and Scottish writers. The course will develop students’ techniques in reading, writing, speaking, and\npresenting. While individual courses may vary, students will generally be expected to read 20-30 pages per night and",
    "matched_line": "Length of Course: Year-Long, linked w/AP English Literature 1-2"
  },
  {
    "page": 28,
    "line": 27,
    "context": "HONORS AMERICAN LITERATURE 1-2 000382 - 000383 GRADES: 11 UC/CSU: “B”\nRecommended Prerequisites: High School English 3-4 or Honors Humanities\nFor students interested in: Seek a more rigorous Language Arts experience and is a good preparation for AP English\nLength of Course: Offered as both a single term course or linked with AP U.S. History 1-2\nAlternate Course ID Numbers: Honors American Literature (single term) 090382-090383\nHonors Survey of American Literature 1-2 is taught at a faster pace and in greater depth than the regular American\nLiterature 1-2 course. Honors American Literature includes the study of the historical, cultural, philosophical, and",
    "matched_line": "Length of Course: Offered as both a single term course or linked with AP U.S. History 1-2"
  },
  {
    "page": 30,
    "line": 11,
    "context": "AP CALCULUS AB 1-2 001060 - 001061 GRADES: 9-12 UC/CSU: “C”\nRecommended Prerequisites: Advanced Functions Analysis or Integrated Math III\nFor students interested in: Pursue a rigorous exploration of math applications in science and business\nLength of Course: Year-Long, linked w/AP Pre-Calculus 1-2\nThis course is a college-level class for students who have completed the equivalent of four years of college preparatory\nmathematics. Topics include derivatives, differentials, integrations, and applications. Many problems are atypical and\nrequire students to synthesize new solutions. A graphing calculator is required. The course is designed to prepare",
    "matched_line": "Length of Course: Year-Long, linked w/AP Pre-Calculus 1-2"
  },
  {
    "page": 31,
    "line": 2,
    "context": "AP PRE-CALCULUS 1-2 001085 - 001086 GRADES: 9-12 UC/CSU: “C”\nRecommended Prerequisites: Integrated Math III\nLength of Course: Year-Long, linked w/AP Calculus AB 1-2 OR Single Term for 11th or 12th graders only\nAlternate Course ID Numbers: AP Pre-Calculus (yearlong with AP Calculus AB) 091085-091086\nIn this course, students study a broad spectrum of function types that are foundational for careers in mathematics,\nphysics, biology, health science, business, social science, and data science.Throughout this course, students develop",
    "matched_line": "Length of Course: Year-Long, linked w/AP Calculus AB 1-2 OR Single Term for 11th or 12th graders only"
  },
  {
    "page": 31,
    "line": 21,
    "context": "Recommended Prerequisites: Advanced Functions Analysis or Integrated Math III\nFor students interested in: Pursue a rigorous exploration of math applications in science, business, psychology, and\nsociology\nLength of Course: Year-Long, linked w/Statistics and College Algebra 1\nThe multidisciplinary aspects and applications of statistics make it one of the most rewarding classes to take. The\nstudy blends the rigor, calculations, and deductive thinking of mathematics, the real-world examples and problems of\nsocial science, the decision-making needs of business and medicine, and the laboratory methods and experimental",
    "matched_line": "Length of Course: Year-Long, linked w/Statistics and College Algebra 1"
  },
  {
    "page": 32,
    "line": 2,
    "context": "COLLEGE ALGEBRA 1 001054 GRADES: 9-12 UC/CSU: Pending\nRecommended Prerequisites: Integrated Math III\nLength of Course: Year-Long, linked w/Statistics and AP Statistics 1-2\nCollege Algebra is a college preparatory course which will focus on a variety of mathematical topics. These topics\ninclude, but are not limited to, advanced algebra, advanced geometry, trigonometry, and mathematical modeling. This\nwill strengthen conceptual understanding needed for successful transition and completion of a four-year college or",
    "matched_line": "Length of Course: Year-Long, linked w/Statistics and AP Statistics 1-2"
  },
  {
    "page": 33,
    "line": 26,
    "context": "STATISTICS 001039 GRADES: 9-12 UC/CSU: “C”\nRecommended Prerequisites: Advanced Functions Analysis or Integrated Math III\nFor students interested in: Exposure to and application of statistical analysis and trigonometric functions\nLength of Course: Year-Long, linked w/AP Statistics 1-2 and College Algebra 1\nStatistics is a college preparatory course which will introduce students to the major concepts and tools for collecting,\nanalyzing, and drawing conclusions from data. Probability and counting methods are included. Students will apply\ndescriptive statistics to a wide range of disciplines. This course may be used to meet the UC/CSU “C” requirement.",
    "matched_line": "Length of Course: Year-Long, linked w/AP Statistics 1-2 and College Algebra 1"
  },
  {
    "page": 34,
    "line": 5,
    "context": "Recommended Prerequisites: Chemistry and Integrated Math II or higher\nFor students interested in: Pursue a rigorous exploration of the biological sciences and their applications to real world\nexamples\nLength of Course: Year-Long, linked w/Honors Biology\nAdvanced Placement Biology 3-4 is planned to meet the objectives of a general biology course on the college level.\nTopics covered include the chemical basis of biology, cells, their specialization and reproduction, energy\ntransformation, heredity and genetics, the origin of life, the structure and function in higher plants and in animals,",
    "matched_line": "Length of Course: Year-Long, linked w/Honors Biology"
  },
  {
    "page": 35,
    "line": 4,
    "context": "Recommended Prerequisites: Chemistry and Integrated Math II or higher\nFor students interested in: Pursue a rigorous exploration of the biological sciences and their applications to real world\nexamples\nLength of Course: Year-Long, linked w/AP Biology\nHonors Biology 1-2 is a rigorous, accelerated laboratory science course which focuses on investigating major biological\nconcepts. In addition, emphasis will be placed on the study of chemistry, physics, and statistical analysis as applied to\nbiological systems, genetics, evolution, ecology, and physiological processes in organisms. This course may be used to",
    "matched_line": "Length of Course: Year-Long, linked w/AP Biology"
  },
  {
    "page": 37,
    "line": 6,
    "context": "Recommended Prerequisites: Physics 1-2 and Integrated Math II or higher\nFor students interested in: Pursue a rigorous, quantitative exploration of the atomic world and its application to many\nbranches of science\nLength of Course: Year-Long, linked w/Honors Chemistry\nThe course is a rigorous investigation of the principles of chemistry. Emphasis is placed on qualitative and quantitative\nunderstanding of thermodynamics, stoichiometry, kinetics and equilibrium. The laboratory component stresses a\nhands-on approach using contemporary scientific equipment. The curriculum parallels general chemistry courses at",
    "matched_line": "Length of Course: Year-Long, linked w/Honors Chemistry"
  },
  {
    "page": 37,
    "line": 23,
    "context": "AP PHYSICS 1A-1B 001216 - 001217 GRADES: 9-12 UC/CSU: “D”\nRecommended Prerequisites: Concurrent enrollment in Honors Pre-Calculus or Advanced Functions Analysis\nFor students interested in: Further study of physics\nLength of Course: Year-Long, linked w/Physics of the Universe 1-2\nAP Physics 1 is an algebra-based, introductory college-level physics course. Students cultivate their understanding of\nPhysics through inquiry-based investigations as they explore topics such as Newtonian mechanics (including rotational\nmotion); work, energy, and power; mechanical waves and sound; and introductory, simple circuits. Twenty-five",
    "matched_line": "Length of Course: Year-Long, linked w/Physics of the Universe 1-2"
  },
  {
    "page": 38,
    "line": 3,
    "context": "AP PHYSICS C: ELECTRICITY & MAGNETISM 1-2 001264 - 001265 GRADES: 9-12 UC/CSU: “D”\nRecommended Prerequisites: Completion of AP Physics C: Mechanics\nFor students interested in: A rigorous calculus based course that studies the laws of electricity and magnetism\nLength of Course: Year-Long, linked w/AP Physics C: Mechanics\nThe Advanced Placement Physics C 2A-2B course forms the second part of the college sequence that serves as the\nfoundation in physics for college physics students. The topics of electricity and magnetism will be the emphasis of the\ncourse; however, other related topics may be covered. Methods of calculus will be taught and used in conjunction",
    "matched_line": "Length of Course: Year-Long, linked w/AP Physics C: Mechanics"
  },
  {
    "page": 38,
    "line": 12,
    "context": "AP PHYSICS C: MECHANICS 1-2 001262 - 001263 GRADES: 9-12 UC/CSU: “D”\nRecommended Prerequisites: Completion of Calculus AB, and AP Physics 1A-1B or Physics 1-2\nFor students interested in: A rigorous calculus based course that studies the laws of motion\nLength of Course: Year-Long, linked w/AP Physics C: Electricity & Magnetism\nAdvanced Placement Physics C 1A-1B course forms the first part of the college sequence that serves as the foundation\nin physics for college physics students. The topic of mechanics will be the emphasis of the course; however, other\nrelated topics may be covered. Strong emphasis is placed on laboratory experience and problem solving. This course",
    "matched_line": "Length of Course: Year-Long, linked w/AP Physics C: Electricity & Magnetism"
  },
  {
    "page": 39,
    "line": 4,
    "context": "Recommended Prerequisites: Physics 1-2 and Integrated Math II or higher\nFor students interested in: Pursue a rigorous, quantitative exploration of the atomic world and its application to many\nbranches of science\nLength of Course: Year-Long, linked w/AP Chemistry\nHonors Chemistry 1-2 is a rigorous, accelerated laboratory science course which will focus on major principles and\nconcepts of chemistry. In addition, emphasis will be placed on the study of physical chemistry, thermodynamics,\nequilibrium, stoichiometry, kinetics, atomic structure and chemical bonding, redox, and acid base. This course may be",
    "matched_line": "Length of Course: Year-Long, linked w/AP Chemistry"
  },
  {
    "page": 40,
    "line": 18,
    "context": "AP SPANISH LANGUAGE 1-2 000484 - 000485 GRADES: 9-12 UC/CSU: “E”\nRecommended Prerequisites: Spanish 7-8\nFor students interested in: Rigorous college level Spanish course that serves to prepare for the AP test\nLength of Course: Year-Long, linked w/Honors Spanish 7-8\nAdvanced Placement Spanish Language refines the skills required for advanced work equivalent to a third year college\nlevel course and for the AP Language examination. Extensive reading, writing and speaking practice increases the\ncompetency level to that required on the AP examination. Selected literary works are analyzed. This course may be",
    "matched_line": "Length of Course: Year-Long, linked w/Honors Spanish 7-8"
  },
  {
    "page": 44,
    "line": 19,
    "context": "HONORS SPANISH 7-8 000496 - 000497 GRADES: 9-12 UC/CSU: “E”\nRecommended Prerequisites: Spanish 7-8\nFor students interested in: Ongoing mastery of language as well as beginning exposure to Spanish literature\nLength of Course: Year-Long, linked w/AP Spanish Language 1-2\nHonors Spanish 7-8 will further develop and refine knowledge, skills, and attitudes related to specific themes.\nGrammar instruction will be in-depth with sufficient preparation to continue on to Advanced Placement Spanish.\nWithin this context, appropriate emphasis will be placed on student competency in the areas of reading, writing,",
    "matched_line": "Length of Course: Year-Long, linked w/AP Spanish Language 1-2"
  },
  {
    "page": 48,
    "line": 19,
    "context": "Recommended Prerequisites: Audition. Students auditioning must demonstrate technical dance skills at a minimum\nof an intermediate dance level and an ability to choreograph and learn quickly\nFor students interested in: Marching band and field performances/competition\nLength of Course: Year-Long, linked w/Marching Tall Flags (Dance Prop)\nAlternate Course ID Numbers: Marching PE Tall Flags 001199-001193\nThe course provides a means to develop an awareness and understanding of the styles, idioms, performance medium,\nand purposes of music and dance that are part of our multicultural heritage and to provide a sound basis of musical",
    "matched_line": "Length of Course: Year-Long, linked w/Marching Tall Flags (Dance Prop)"
  },
  {
    "page": 51,
    "line": 21,
    "context": "Recommended Prerequisites: Studio Art\nFor students interested in: An assembly of art projects completed previously into a portfolio and submission for\nevaluation on rigorous standards\nLength of Course: Year-Long, linked w/Studio Art\nAdvanced Placement Studio Art: 2D Design provides instruction for the highly skilled exceptional students in\ntwo-dimensional design. The course assists these students in the preparation of a 2D Portfolio. It is designed to\naddress a very broad interpretation of two-dimensional design issues. This type of design involves purposeful",
    "matched_line": "Length of Course: Year-Long, linked w/Studio Art"
  },
  {
    "page": 52,
    "line": 4,
    "context": "Recommended Prerequisites: Studio Art\nFor students interested in: Assembly of art projects completed previously into a portfolio and submission for\nevaluation on rigorous standards\nLength of Course: Year-Long, linked w/Studio Art\nAdvanced Placement Studio Art: 3D Design provides instruction for the highly skilled exceptional students in 3D\nDesign. The course assists these students in the preparation of a Three-Dimensional Design Portfolio. It is designed to\naddress a very broad interpretation of sculpture issues in depth and space. These may include mass, volume, form,",
    "matched_line": "Length of Course: Year-Long, linked w/Studio Art"
  },
  {
    "page": 52,
    "line": 17,
    "context": "Recommended Prerequisites: Studio Art\nFor students interested in: An assembly of art projects completed previously into a portfolio and submission for\nevaluation on rigorous standards\nLength of Course: Year-Long, linked w/Studio Art\nAdvanced Placement Studio Art: Drawing provides instruction for the highly skilled exceptional students in drawing,\npainting, and three dimensional design. The course assists these students in the preparation of a portfolio for the\nAdvanced Placement program in Studio Art. Portfolio preparation involves a significant time commitment and is,",
    "matched_line": "Length of Course: Year-Long, linked w/Studio Art"
  },
  {
    "page": 58,
    "line": 3,
    "context": "STUDIO ART 1-2: CERAMICS 000150 GRADES: 9-12 UC/CSU: “F”\nRecommended Prerequisites: Ceramics 3-4\nFor students interested in: An assembly of art projects completed previously into a portfolio.\nLength of Course: Year-Long, linked w/AP Studio Art\nAlternate Course ID Numbers: Studio Art 1-2: Ceramics 190150-190151\nStudio Art is for those students who have advanced skills. The course is for students who have completed all other\ncourses in one of the following areas or wish to pursue further study in that area: Drawing and Painting, Design and",
    "matched_line": "Length of Course: Year-Long, linked w/AP Studio Art"
  },
  {
    "page": 58,
    "line": 13,
    "context": "STUDIO ART 1-2: DIGITAL PHOTOGRAPHY 000150 GRADES: 9-12 UC/CSU: “F”\nRecommended Prerequisites: Digital Photography 3-4\nFor students interested in: An assembly of art projects completed previously into a portfolio.\nLength of Course: Year-Long, linked w/AP Studio Art\nAlternate Course ID Numbers: Studio Art 1-2: Digital Photography 390150-390151\nStudio Art is for those students who have advanced skills. The course is for students who have completed all other\ncourses in one of the following areas or wish to pursue further study in that area: Drawing and Painting, Design and",
    "matched_line": "Length of Course: Year-Long, linked w/AP Studio Art"
  },
  {
    "page": 58,
    "line": 23,
    "context": "STUDIO ART 1-2: DRAWING & PAINTING 000150 GRADES: 9-12 UC/CSU: “F”\nRecommended Prerequisites: Drawing & Painting 3-4\nFor students interested in: An assembly of art projects completed previously into a portfolio.\nLength of Course: Year-Long, linked w/AP Studio Art\nAlternate Course ID Numbers: Studio Art 1-2: Drawing & Painting 090150-090151\nStudio Art is for those students who have advanced skills. The course is for students who have completed all other\ncourses in one of the following areas or wish to pursue further study in that area: Drawing and Painting, Design and",
    "matched_line": "Length of Course: Year-Long, linked w/AP Studio Art"
  },
  {
    "page": 61,
    "line": 23,
    "context": "Recommended Prerequisites: Audition. Students auditioning must demonstrate technical dance skills at a minimum\nof an intermediate dance level and an ability to choreograph and learn quickly\nFor students interested in: Marching band and field performances/competition\nLength of Course: Year-Long, linked w/(Dance Prop)\nThe Marching PE Flags/Tall Flags (Dance Prop) class is a yearlong performance class and provides students with the\nopportunity to develop musical/visual concepts, skills, and interpretations. These concepts will be used in conjunction\nwith the marching program. Evaluation will be provided by the Southern California School Band and Orchestra",
    "matched_line": "Length of Course: Year-Long, linked w/(Dance Prop)"
  },
  {
    "page": 66,
    "line": 3,
    "context": "AVID\nAVID 1-2 001595 - 001596 GRADES: 9 UC/CSU: “G”\nRecommended Prerequisites: Pass interview process\nLength of Course: Year-Long, linked w/High School English 1-2\nAVID is a program designed to aid students who have college potential and strong work ethic by providing additional\nsupport. Students commit to completing the University of California “A”-“G” requirements, repeating in summer\nschool any class in which they earn a “D” or an “F”, and taking an AVID class each term in combination with a core",
    "matched_line": "Length of Course: Year-Long, linked w/High School English 1-2"
  },
  {
    "page": 66,
    "line": 15,
    "context": "a writing sample will also be considered.\nAVID 3-4 001597 - 001598 GRADES: 10 UC/CSU: “G”\nRecommended Prerequisites: AVID 1-2\nLength of Course: Year-Long, linked w/High School English 3-4\nAVID 3-4 is a continuation of the AVID program for promotion of students with college potential. This course may be\nused to meet the UC/CSU “G” requirement.\nAVID 5-6 001599 - 001600 GRADES: 11 UC/CSU: “G”",
    "matched_line": "Length of Course: Year-Long, linked w/High School English 3-4"
  },
  {
    "page": 66,
    "line": 20,
    "context": "used to meet the UC/CSU “G” requirement.\nAVID 5-6 001599 - 001600 GRADES: 11 UC/CSU: “G”\nRecommended Prerequisites: AVID 3-4\nLength of Course: Year-Long, linked w/ US History 1-2\nThe 11th grade AVID course is an elective class for students who are college bound. To ensure continued success in\ncollege-prep course work, students work individually, as well as in tutor-led collaborative groups, to develop stronger\nacademic skills in a variety of content areas. Note taking, outlining, writing, speaking, reading and test taking",
    "matched_line": "Length of Course: Year-Long, linked w/ US History 1-2"
  },
  {
    "page": 72,
    "line": 5,
    "context": "Recommended Prerequisites: Completion of Integrated Math I or II with “C” or better; concurrently enrolled in or\ncompleted Integrated III\nFor students interested in: Computer technology and software\nLength of Course: Year-Long, linked w/ Computer Science & Software Engineering 1-2 or Data Structures 1-2\nThis course is designed to build upon the fundamentals of computer programming. The emphasis is on object-oriented\nprogramming methodology, problem solving and algorithm development, and is equivalent to a first-semester college\ncourse in Computer Science. Topics include arrays, recursion, inheritance, sorting and searching algorithms, and a case",
    "matched_line": "Length of Course: Year-Long, linked w/ Computer Science & Software Engineering 1-2 or Data Structures 1-2"
  },
  {
    "page": 73,
    "line": 24,
    "context": "COMPUTER SCIENCE AND SOFTWARE ENGINEERING 000971 - 000972 GRADES: 9-12 UC/CSU: “G”\nRecommended Prerequisites: None\nFor students interested in: Computer science\nLength of Course: Year-Long, linked w/AP Computer Science A 1-2\nComputer Science & Software Engineering 1-2 aims to develop computational thinking, to introduce computational\ntools that foster creativity, and to gain exposure to program code and design. Additionally, the course aims to build\nstudents’ awareness of the tremendous workplace demand for computer specialists and for professionals in all fields",
    "matched_line": "Length of Course: Year-Long, linked w/AP Computer Science A 1-2"
  },
  {
    "page": 73,
    "line": 35,
    "context": "DATA STRUCTURES 1-2 001072 - 001073 GRADES: 9-12 UC/CSU: “G”\nRecommended Prerequisites: Concurrently enrolled in or completed AP Calculus or AFA; or teacher recommendation\nFor students interested in: Computer technology and software development\nLength of Course: Year-Long, linked w/AP Computer Science A 1-2\nThis course follows AP Computer Science A. It covers a more formal and in-depth study of algorithms, data structures,\ndesign and abstraction. The topics include Big-O analysis, exceptions, and advanced data structures (such as linked\nlists, stacks, queues, trees, heaps, sets and maps). It is equivalent to a second semester college course in Computer",
    "matched_line": "Length of Course: Year-Long, linked w/AP Computer Science A 1-2"
  }
]